<template>
  <div class="card">
    <h1>Какие данные собираются и почему это безопасно</h1>
    <p>Сервис анализирует отправленные сообщения. Весь анализ происходит локально <b>на вашем</b> компьютере и состоит
      из следуюших шагов:</p>
    <ol>
      <li>Берётся только текст из ваших сообщений</li>
      <li>Разбивается на отдельные слова</li>
      <li>Из слов удаляются все спец-символы, смайлики, цифры (пароли, телефоны, эллектронные почты не пройдут)</li>
      <li>Слова группируются по дням из всех диалогов и <b>перемешиваются</b></li>
      <li>Перемешенные и отфильтровнные слова отправляются на общий</li>
    </ol>
    <h3>Пример сбора данных</h3>
    <h3>Как убедиться, что мы не обманываем?</h3>
    <ol>
      <li>Весь наш исходный код находится в публичном доступе на <a href="https://github.com/message-stat"
          target="_blank">GitHub</a>
      </li>
      <li>Через веб-инспектор браузера, в разделе <b>Network</b> вы можете посмотреть, какие именно данные отправляются
        на наш общий</li>
    </ol>
  </div>
</template>
